using System;
/* Напишите программу с классом, в котором есть два поля: символьное и текстовое.
 * В классе должен быть перегруженный метод для присваивания значений полям.
 * Если метод вызывается с символьным аргументов, то соответствующее значение присваивается символьному полю.
 * Если метод вызывается с текстовым аргументом, то он определяет значение текстового поля.
 * Методу аргументом также может передаваться символьный массив.
 * Если массив состоит из одного элемента, то он определяет значение символьного поля.
 * В противном случае (если в массиве больше одного элемента) из символов массива формируется текстовая строка и 
 * присваивается значением текстовому полю.
 */
